[
    {
        "title": "Python Programming",
        "image": "https://i.ibb.co/ZmhTFrJ/python-applications.png",
        "author": "John Smith",
        "category": "Programming",
        "price": 29.99,
        "rating": 4.5,
        "course_date": "5/20/2024",
        "lectures": 30,
        "booking_date": "5/10/2024",
        "time_period": "6 weeks",
        "details": "Python Programming for Beginners is a comprehensive guide designed for those who have little to no experience with coding. Authored by John Smith, a seasoned Python developer, this course covers the fundamentals of Python syntax, data structures, and control flow. Throughout the 6-week duration, students will engage in hands-on exercises and projects to solidify their understanding of key concepts. By the end of the course, participants will be equipped with the skills necessary to write basic Python programs and explore more advanced topics."
    },
    {
        "title": "Web Development",
        "image": "https://i.ibb.co/Q6Kf5y4/oen-YHim-Rv-OZh-Es-Ewn6-PQ.png",
        "author": "Emily Brown",
        "category": "Programming",
        "price": 39.99,
        "rating": 4.7,
        "course_date": "6/22/2024",
        "lectures": 20,
        "booking_date": "5/20/2024",
        "time_period": "8 weeks",
        "details": "JavaScript Web Development is a comprehensive course tailored for individuals interested in building interactive web applications. Led by Emily Brown, a seasoned web developer, this course covers the fundamentals of JavaScript programming along with essential web development concepts such as DOM manipulation and AJAX. Over the 8-week duration, participants will work on real-world projects to apply their skills and gain practical experience. By the end of the course, students will be proficient in front-end web development using JavaScript."
    },
    {
        "title": "Java Programming",
        "image": "https://i.ibb.co/4TKcq9C/90078629.jpg",
        "author": "Michael Johnson",
        "category": "Programming",
        "price": 49.99,
        "rating": 4.8,
        "course_date": "7/15/2024",
        "lectures": 30,
        "booking_date": "6/20/2024",
        "time_period": "10 weeks",
        "details": "Java Programming Masterclass is a comprehensive course suitable for both beginners and experienced programmers looking to master Java. Taught by Michael Johnson, a Java expert with years of industry experience, this course covers everything from basic syntax to advanced topics like multithreading and database connectivity. With a duration of 10 weeks, students will engage in hands-on coding exercises and projects to reinforce their learning. Upon completion, participants will have the skills and confidence to develop robust Java applications for various platforms."
    },
    {
        "title": "Landscape Photography",
        "image": "https://i.ibb.co/5Lz7YDd/landscape-and-nature-photography-course-dps11.webp",
        "author": "David Miller",
        "category": "Photography",
        "price": 59.99,
        "rating": 4.8,
        "course_date": "7/23/2024",
        "lectures": 22,
        "booking_date": "6/23/2024",
        "time_period": "6 weeks",
        "details": "Explore the beauty of the natural world and master the art of landscape photography. Learn how to capture stunning landscapes, from majestic mountains to tranquil seascapes, and create images that evoke a sense of awe and wonder. Gain practical skills in composition, exposure, and post-processing to enhance the impact and beauty of your landscape photographs. Whether you're shooting in your backyard or traveling to exotic destinations, this course will provide you with the knowledge and techniques needed to capture breathtaking landscapes and take your photography to the next level."
    },
    {
        "title": "C++ Programming",
        "image": "https://i.ibb.co/4K50jff/CPP-Language.png",
        "author": "David Clark",
        "category": "Programming",
        "price": 44.99,
        "rating": 4.6,
        "course_date": "5/25/2024",
        "lectures": 40,
        "booking_date": "4/20/2024",
        "time_period": "12 weeks",
        "details": "C++ Programming: From Basics to Advanced is a comprehensive course designed to take learners from novice to proficient C++ developers. Authored by David Clark, an experienced software engineer, this course covers essential C++ concepts such as classes, inheritance, and templates, as well as advanced topics like memory management and concurrency. Over the 12-week duration, students will work on practical assignments and projects to gain hands-on experience. By the end of the course, participants will have a strong foundation in C++ programming and be ready to tackle complex software development tasks."
    },
    {
        "title": "Data Structures",
        "image": "https://i.ibb.co/yR8FrS7/intro-data-structure-1.png",
        "author": "Sarah Lee",
        "category": "Programming",
        "price": 34.99,
        "rating": 4.9,
        "course_date": "9/20/2024",
        "lectures": 35,
        "booking_date": "8/10/2024",
        "time_period": "8 weeks",
        "details": "Data Structures and Algorithms in Python is a comprehensive course aimed at individuals seeking to strengthen their problem-solving skills and algorithmic thinking. Led by Sarah Lee, an experienced software engineer, this course covers a wide range of data structures such as arrays, linked lists, and trees, along with algorithms like sorting and searching. Throughout the 8-week duration, participants will solve challenging problems and implement algorithms in Python. By the end of the course, students will be equipped with the knowledge and techniques necessary to tackle complex programming challenges with confidence."
    },
    {
        "title": "Financial Markets",
        "image": "https://i.ibb.co/K7hfCLG/blog-financial-markets.jpg",
        "author": "Sophia Davis",
        "category": "Finance",
        "price": 39.99,
        "rating": 4.6,
        "course_date": "6/30/2024",
        "lectures": 17,
        "booking_date": "5/28/2024",
        "time_period": "8 weeks",
        "details": "Explore the fascinating world of financial markets and learn how they function. Gain insights into the workings of stock markets, bond markets, foreign exchange markets, and derivatives markets. Learn how to analyze market trends, interpret financial news, and make informed trading decisions. Whether you're an aspiring trader, investor, or finance professional, this course will provide you with a deep understanding of financial markets and the factors that influence their behavior."
    },
    {
        "title": "Product Design",
        "image": "https://i.ibb.co/R7FnmtT/copy-of-inlet-banking-04-2.png",
        "author": "Michael Johnson",
        "category": "Design",
        "price": 69.99,
        "rating": 4.5,
        "course_date": "7/30/2024",
        "lectures": 20,
        "booking_date": "6/10/2024",
        "time_period": "12 weeks",
        "details": "Discover the art and science of product design and learn how to create innovative and user-centered products. Explore the product design process, from ideation and prototyping to testing and iteration, to develop products that meet user needs and solve real-world problems. Gain insights into user research, design thinking, and usability testing to create products that are not only functional but also delightful to use. Whether you're a designer, engineer, or entrepreneur, this course will provide you with the skills and mindset needed to design products that make a positive impact on people's lives."
    },
    {
        "title": "Wildlife Photography",
        "image": "https://i.ibb.co/hdPymsQ/Melbourne-wildlife-photography-course-7228-9.jpg",
        "author": "Michael Johnson",
        "category": "Photography",
        "price": 69.99,
        "rating": 4.5,
        "course_date": "7/20/2024",
        "lectures": 17,
        "booking_date": "6/22/2024",
        "time_period": "12 weeks",
        "details": "Embark on an adventure into the wild world of wildlife photography and capture breathtaking images of animals in their natural habitats. Learn essential techniques for wildlife photography, including fieldcraft, patience, and perseverance, to capture intimate portraits and dramatic action shots of wildlife. Explore different equipment and gear options, from telephoto lenses to camouflage clothing, to get up close and personal with your subjects while respecting their natural behaviors and environments. Whether you're photographing birds in your backyard or big cats on an African safari, this course will provide you with the skills and techniques needed to become a successful wildlife photographer."
    },
    {
        "title": "Stress Relief",
        "image": "https://i.ibb.co/6rQFSdP/stress-relief-hero.jpg",
        "author": "Emily Smith",
        "category": "Health",
        "price": 29.99,
        "rating": 4.7,
        "course_date": "8/20/2024",
        "lectures": 24,
        "booking_date": "7/28/2024",
        "time_period": "4 weeks",
        "details": "Discover the transformative power of mindfulness meditation and alleviate stress and anxiety with this comprehensive course. Learn practical techniques to cultivate mindfulness, including breath awareness, body scans, and loving-kindness practices. Through guided meditations and mindfulness exercises, you'll develop a deeper awareness of the present moment and learn to respond to stressors with calm and clarity. Whether you're new to meditation or seeking to deepen your practice, this course will provide you with the tools and support needed to incorporate mindfulness into your daily life and experience greater peace and well-being."
    },
    {
        "title": "Yoga Journey",
        "image": "https://i.ibb.co/L93cVm7/yoga-2020-blog.jpg",
        "author": "Michael Johnson",
        "category": "Health",
        "price": 49.99,
        "rating": 4.8,
        "course_date": "10/20/2024",
        "lectures": 15,
        "booking_date": "9/10/2024",
        "time_period": "6 weeks",
        "details": "Improve your flexibility, strength, and overall well-being with this dynamic yoga course. Explore a variety of yoga poses and sequences designed to enhance flexibility, build strength, and promote relaxation. Whether you're a beginner or an experienced yogi, you'll find classes tailored to your level and goals, with options for gentle stretching, vigorous flow, and restorative practices. With expert guidance and modifications for all body types, this course offers a safe and supportive environment to explore the transformative benefits of yoga. Join a community of like-minded individuals and embark on a journey to greater health and vitality."
    },
    {
        "title": "Risk Management",
        "image": "https://i.ibb.co/spTRnT3/Untitled-design-76.png",
        "author": "Michael Johnson",
        "category": "Finance",
        "price": 69.99,
        "rating": 4.5,
        "course_date": "12/10/2024",
        "lectures": 33,
        "booking_date": "11/20/2024",
        "time_period": "12 weeks",
        "details": "Learn how to identify, assess, and mitigate financial risks with effective risk management strategies. Explore different types of financial risks, including market risk, credit risk, liquidity risk, and operational risk, and learn how to manage them to protect assets and enhance financial performance. Gain practical skills in risk analysis, risk modeling, and risk mitigation techniques to develop robust risk management plans. Whether you're a risk manager, financial analyst, or business leader, this course will provide you with the knowledge and tools needed to navigate uncertain environments and safeguard your organization's financial health."
    },
    {
        "title": "Motion Graphics",
        "image": "https://i.ibb.co/PGnpt8B/Motion-Graphics-Header-VMG-Studios-thumb.jpg",
        "author": "Sophia Davis",
        "category": "Design",
        "price": 39.99,
        "rating": 4.6,
        "course_date": "7/25/2024",
        "lectures": 55,
        "booking_date": "5/29/2024",
        "time_period": "8 weeks",
        "details": "Explore the exciting world of motion graphics and learn how to bring your designs to life with animation and visual effects. Master the principles of motion design, timing, and pacing to create dynamic and engaging animations for videos, websites, and multimedia projects. Gain hands-on experience with industry-standard software tools like Adobe After Effects and Cinema 4D to create stunning motion graphics and special effects. Whether you're a graphic designer, animator, or filmmaker, this course will provide you with the skills and techniques needed to create compelling motion graphics that captivate audiences."
    },
    {
        "title": "Portrait Photography",
        "image": "https://i.ibb.co/DbSsGFX/Photography-for-Beginners.jpg",
        "author": "Emma Thompson",
        "category": "Photography",
        "price": 49.99,
        "rating": 4.7,
        "course_date": "9/20/2024",
        "lectures": 19,
        "booking_date": "8/20/2024",
        "time_period": "4 weeks",
        "details": "Master the art of portrait photography and capture stunning portraits that tell a story. Learn essential techniques for posing, lighting, and composition to create compelling portraits that showcase the personality and character of your subjects. Explore different styles of portraiture, from candid snapshots to formal studio portraits, and discover how to connect with your subjects to evoke genuine emotions and expressions. Whether you're a beginner or an experienced photographer, this course will provide you with the skills and confidence to create beautiful portraits that leave a lasting impression."
    },
    {
        "title": "Mind-Body Wellness",
        "image": "https://i.ibb.co/9rq20CL/Best-Poses-For-Yoga-Beginners-HERO.jpg",
        "author": "Andrew Miller",
        "category": "Health",
        "price": 59.99,
        "rating": 4.9,
        "course_date": "6/5/2024",
        "lectures": 23,
        "booking_date": "5/3/2024",
        "time_period": "10 weeks",
        "details": "Achieve holistic wellness and balance in your life with this comprehensive mind-body course. Explore the interconnectedness of mind, body, and spirit, and learn practical techniques to promote overall well-being. From mindfulness and meditation to yoga and breathwork, you'll discover a variety of practices to reduce stress, improve sleep, and enhance your mental and physical health. With expert guidance and personalized support, you'll create a customized wellness plan that fits your unique needs and goals. Whether you're looking to reduce stress, improve your physical fitness, or cultivate a deeper sense of peace and fulfillment, this course will empower you to live your best life."
    },
    {
        "title": "Sleep Well",
        "image": "https://i.ibb.co/GRwyVWw/Sleep-Course-Picture.png",
        "author": "Sophia Davis",
        "category": "Health",
        "price": 19.99,
        "rating": 4.5,
        "course_date": "7/24/2024",
        "lectures": 15,
        "booking_date": "6/20/2024",
        "time_period": "12 weeks",
        "details": "Unlock the secrets to better sleep and improve your overall health and well-being with this comprehensive course on sleep wellness. Learn evidence-based strategies to overcome common sleep challenges, including insomnia, restless nights, and daytime fatigue. From sleep hygiene and relaxation techniques to cognitive-behavioral therapy for insomnia (CBT-I), you'll discover a variety of tools to help you achieve restful and rejuvenating sleep. Whether you're struggling with sleep issues or simply looking to optimize your sleep quality, this course will provide you with the knowledge and skills needed to achieve better sleep and wake up feeling refreshed and revitalized."
    },
    {
        "title": "Graphic Design",
        "image": "https://i.ibb.co/9qdSwfh/course-8-image.jpg",
        "author": "Emma Thompson",
        "category": "Design",
        "price": 49.99,
        "rating": 4.7,
        "course_date": "9/20/2024",
        "lectures": 30,
        "booking_date": "8/20/2024",
        "time_period": "4 weeks",
        "details": "Master the fundamentals of graphic design and unleash your creativity. Learn essential design principles, typography, color theory, and layout techniques to create visually stunning designs for print and digital media. Explore industry-standard software tools like Adobe Photoshop, Illustrator, and InDesign to bring your design ideas to life. Whether you're a beginner or an experienced designer, this course will provide you with the skills and knowledge needed to excel in the dynamic field of graphic design."
    },
    {
        "title": "Digital Marketing",
        "image": "https://i.ibb.co/xfWxd6x/digital-marketing-benefits.jpg",
        "author": "John Smith",
        "category": "Marketing",
        "price": 49.99,
        "rating": 4.7,
        "course_date": "7/20/2024",
        "lectures": 38,
        "booking_date": "6/20/2024",
        "time_period": "4 weeks",
        "details": "Explore the core concepts and strategies of digital marketing in this comprehensive course. Learn how to develop effective digital marketing campaigns across various channels, including social media, email, search engines, and more. Gain practical skills in content creation, analytics, and optimization to drive traffic, generate leads, and increase conversions. Whether you're a beginner or an experienced marketer, this course will equip you with the knowledge and tools needed to succeed in the fast-paced world of digital marketing."
    },
    {
        "title": "Social Media",
        "image": "https://i.ibb.co/mh1bfHV/socialmediamarketingstrategy-1650293336008.jpg",
        "author": "Emily Johnson",
        "category": "Marketing",
        "price": 59.99,
        "rating": 4.8,
        "course_date": "5/12/2024",
        "lectures": 35,
        "booking_date": "4/10/2024",
        "time_period": "6 weeks",
        "details": "Master the art of social media marketing and harness the power of social platforms to grow your brand and engage your audience. Learn how to create compelling content, optimize your profiles, and leverage advertising to reach your target audience effectively. Explore advanced strategies for community building, influencer partnerships, and social media analytics to drive meaningful results for your business. Whether you're a small business owner, marketing professional, or aspiring social media influencer, this course will provide you with the skills and knowledge to excel in social media marketing."
    },
    {
        "title": "Investment Fundamentals",
        "image": "https://i.ibb.co/qN8H4F8/ewx-Us-N9w-Qm-Ko-BYRFOd-TH.jpg",
        "author": "David Miller",
        "category": "Finance",
        "price": 59.99,
        "rating": 4.8,
        "course_date": "7/30/2024",
        "lectures": 30,
        "booking_date": "6/20/2024",
        "time_period": "6 weeks",
        "details": "Gain a solid understanding of investment fundamentals and learn how to build a successful investment portfolio. Explore different asset classes, investment strategies, and risk-return trade-offs to maximize returns and minimize risk. Learn how to analyze financial markets, evaluate investment opportunities, and make informed investment decisions. Whether you're a novice investor or seasoned professional, this course will provide you with the knowledge and skills needed to navigate the complexities of the investment world and achieve your financial goals."
    },
    {
        "title": "Content Marketing",
        "image": "https://i.ibb.co/P6j4tgq/image-286.png",
        "author": "Sarah Davis",
        "category": "Marketing",
        "price": 39.99,
        "rating": 4.6,
        "course_date": "7/20/2024",
        "lectures": 20,
        "booking_date": "6/20/2024",
        "time_period": "8 weeks",
        "details": "Develop a results-driven content marketing strategy to attract, engage, and convert your target audience. Learn how to create high-quality content that resonates with your audience's needs and interests, and distribute it effectively across various channels. Gain insights into content planning, creation, distribution, and measurement to drive brand awareness, generate leads, and nurture customer relationships. Whether you're a content marketer, business owner, or marketing professional, this course will provide you with the skills and techniques needed to develop and execute a successful content marketing strategy."
    },
    {
        "title": "Business Strategy",
        "image": "https://i.ibb.co/WVHC4my/business-strategy.jpg",
        "author": "John Smith",
        "category": "Business",
        "price": 49.99,
        "rating": 4.7,
        "course_date": "9/9/2024",
        "lectures": 22,
        "booking_date": "8/8/2024",
        "time_period": "4 weeks",
        "details": "Master the fundamentals of business strategy and gain a competitive edge in the marketplace. Learn how to analyze industry trends, assess competitive landscapes, and develop strategic plans to achieve long-term growth and success. Explore frameworks for strategic decision-making, including SWOT analysis, Porter's Five Forces, and value chain analysis, to identify opportunities and mitigate risks. Whether you're a business owner, manager, or aspiring entrepreneur, this course will provide you with the knowledge and tools needed to formulate and execute effective business strategies."
    },
    {
        "title": "Marketing Management",
        "image": "https://i.ibb.co/BtgRTNK/marketing-management.jpg",
        "author": "Emily Johnson",
        "category": "Business",
        "price": 59.99,
        "rating": 4.8,
        "course_date": "7/20/2024",
        "lectures": 28,
        "booking_date": "6/25/2024",
        "time_period": "6 weeks",
        "details": "Gain expertise in marketing management and learn how to develop and implement strategic marketing plans that drive business growth. Explore the principles of marketing strategy, market research, product development, pricing, promotion, and distribution to create and deliver value to customers. Learn how to analyze market dynamics, consumer behavior, and competitive landscapes to make informed marketing decisions and achieve marketing objectives. Whether you're a marketing professional, business owner, or aspiring marketer, this course will provide you with the skills and knowledge needed to excel in marketing management."
    },
    {
        "title": "Financial Planning",
        "image": "https://i.ibb.co/cTTSNb5/paper-layout-with-financial-information.jpg",
        "author": "Emily Thompson",
        "category": "Finance",
        "price": 49.99,
        "rating": 4.7,
        "course_date": "8/22/2024",
        "lectures": 30,
        "booking_date": "7/20/2024",
        "time_period": "4 weeks",
        "details": "Master the art of financial planning and take control of your financial future. Learn how to set financial goals, create budgets, manage debt, and save for retirement. Gain insights into investment strategies, asset allocation, and risk management to build wealth and achieve financial security. Whether you're just starting your career or planning for retirement, this course will provide you with the knowledge and tools needed to make informed financial decisions and achieve your financial goals."
    },
    {
        "title": "Financial Management",
        "image": "https://i.ibb.co/JByc25j/i-Stock-1070910534-scaled.jpg",
        "author": "Michael Anderson",
        "category": "Business",
        "price": 39.99,
        "rating": 4.6,
        "course_date": "7/15/2024",
        "lectures": 40,
        "booking_date": "6/20/2024",
        "time_period": "8 weeks",
        "details": "Master the principles of financial management and learn how to optimize financial resources to drive business success. Gain insights into financial analysis, budgeting, forecasting, capital investment decisions, and risk management to make sound financial decisions and achieve financial objectives. Learn how to interpret financial statements, assess financial performance, and communicate financial information effectively to stakeholders. Whether you're a business owner, manager, or aspiring financial professional, this course will provide you with the skills and knowledge needed to navigate the complexities of financial management."
    },
    {
        "title": "Leadership Development",
        "image": "https://i.ibb.co/q5613yj/leadership-development-1024x430-1.jpg",
        "author": "Sophia Davis",
        "category": "Business",
        "price": 29.99,
        "rating": 4.9,
        "course_date": "10/20/2024",
        "lectures": 25,
        "booking_date": "9/10/2024",
        "time_period": "10 weeks",
        "details": "Develop your leadership skills and unlock your full potential as a business leader. Learn essential leadership principles, styles, and strategies to inspire and motivate teams, drive organizational change, and achieve business objectives. Gain insights into effective communication, decision-making, conflict resolution, and team-building to lead with confidence and integrity. Whether you're a new manager, seasoned executive, or aspiring leader, this course will provide you with the tools and techniques needed to excel in leadership roles and drive business success."
    }
]